flow-examples/class7/deleteRequest.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" 
			   xmlns:dat="http://ws.wso2.org/dataservice">
   <soapenv:Header/>
   <soapenv:Body>
      <dat:mockDelete>
         <dat:nome>fulano2</dat:nome>
      </dat:mockDelete>
   </soapenv:Body>
</soapenv:Envelope>